---
kind: method
id: M:Autodesk.Revit.DB.DGNExportOptions.SetExportLineweightTable(Autodesk.Revit.DB.ExportLineweightTable)
source: html/fce36964-2004-fb85-dfc3-84d49cd42ffa.htm
---
# Autodesk.Revit.DB.DGNExportOptions.SetExportLineweightTable Method

Sets the line weight table to use during export.

## Syntax (C#)
```csharp
public void SetExportLineweightTable(
	ExportLineweightTable lineweightTable
)
```

## Parameters
- **lineweightTable** (`Autodesk.Revit.DB.ExportLineweightTable`) - The line weight table to be set.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null